import streamlit as st
import pandas as pd

st.set_page_config(page_title="🌮南宁美食地图🌮")
st.title("🧀 南宁美食探索 🧀")

# 介绍
st.markdown("""
探索广西南宁最受欢迎的美食地点！选择你感兴趣的餐厅类型，查看评分和位置。
""")

# 定义数据,以便创建数据框
data = {
    '店名': ["星艺会尝不忘", "蜜雪冰城", "塔斯汀(火炬路店)", "好友缘", "白妈螺狮粉"],
    "类型": ["中餐", "饮料", "快餐", "自助餐", "中餐"],
    "评分": [4.2, 4.8, 4.5, 4.7, 4.3],
    "价格": [15, 10, 20, 35, 20],
    "位置X": [22.853838, 22.850126,22.835862, 22.809105, 22.839699],
    "位置Y": [108.222177, 108.222890, 108.295162, 108.378664, 108.245804]
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series([1,2,3,4,5], name='序号')
# 将新索引应用到数据框上
df.index = index

#地图坐标展示
st.header("📍 南宁美食地图")

# 创建简单的带点的地图

st.map(pd.DataFrame({
    "lat": df["位置X"],
    "lon": df["位置Y"],
    "店名": df["店名"]
}))

#餐厅评分条形图
st.header("⭐ 餐厅评分")
# 用'店名'列作为df的索引
st.bar_chart(df.set_index('店名')['评分'])


st.header("💰 不同类型餐厅价格")
#新建一个12个月份的走势数据data2
data2= {
    '月份':['01月','02月','03月','04月','05月','06月','07月','08月','09月','10月','11月','12月'],
    '星艺会尝不忘':[17,17,16,15,19,18,20,15,18,20,15,18],
    '蜜雪冰城':[7,9,8,10,6,8,10,12,10,10,11,8],
    '塔斯汀(火炬路店)':[17,20,23,25,25,23,20,25,18,19,16,18],
    '好友缘':[37,27,26,25,29,28,30,35,38,30,35,38],
    '白马螺蛳粉':[19,18,22,19,23,18,17,23,28,23,25,22],
}
#新建一个数据框df2作为展示折线图的数据
df2 = pd.DataFrame(data2)
df2 = df2.set_index('月份')

# 显示折线图
st.line_chart(df2)


#用餐高峰面积图
st.header("📰 用餐高峰时段")
# 创建时间数据
hours = [11, 12, 13, 17, 18, 19]
crowd_data = pd.DataFrame({
    "时间": hours,
    "星艺会尝不忘": [30, 95, 70, 40, 85, 60],
    "蜜雪冰城": [25, 85, 65, 35, 90, 65],
    "塔斯汀(火炬路店)": [40, 80, 50, 45, 75, 55],
    "好友缘": [50, 70, 60, 55, 95, 40],
    "白妈螺狮粉": [80,50, 40, 30, 100, 45],
})

st.area_chart(crowd_data.set_index("时间"))


